Table of Contents
 Class Element1D
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Representation of element1D
[OpenModelClass("CI.StructModel.Structure.Element1D,CI.StructuralElements", "CI.StructModel.Structure.IElement1D,CI.BasicTypes")]
public class Element1D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Element1D
Derived
Beam
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CrossSectionBegin
Gets, sets cross section located in the begining of this element1D
public ReferenceElement CrossSectionBegin { get; set; }
Property Value
ReferenceElement
 CrossSectionEnd
Gets, sets cross section located at the end of this element1D
public ReferenceElement CrossSectionEnd { get; set; }
Property Value
ReferenceElement
 EccentricityBeginX
Local eccentricity X at the begin of Element1D
public double EccentricityBeginX { get; set; }
Property Value
double
 EccentricityBeginY
Local eccentricity Y at the begin of Element1D
public double EccentricityBeginY { get; set; }
Property Value
double
 EccentricityBeginZ
Local eccentricity Z at the begin of Element1D
public double EccentricityBeginZ { get; set; }
Property Value
double
 EccentricityEndX
Local eccentricity X at the end of Element1D
public double EccentricityEndX { get; set; }
Property Value
double
 EccentricityEndY
Local eccentricity Y at the end of Element1D
public double EccentricityEndY { get; set; }
Property Value
double
 EccentricityEndZ
Local eccentricity Z at the end of Element1D
public double EccentricityEndZ { get; set; }
Property Value
double
 Name
Name of Element
public string Name { get; set; }
Property Value
string
 RotationRx
Rotation of Cross-section of Element1D. Difference from default Line LCS
public double RotationRx { get; set; }
Property Value
double
 Segment
Line segment with start point and end point
[OpenModelProperty("LineSegment")]
public ReferenceElement Segment { get; set; }
Property Value
ReferenceElement
 Edit this page